import { Component } from '@angular/core';
import { FormBuilder, Validators } from '@angular/forms';

@Component({
  selector: 'app-mnf-spvs-second',
  templateUrl: './mnf-spvs-second.component.html',
  styleUrls: ['./mnf-spvs-second.component.css']
})
export class MnfSpvsSecondComponent {
  loading: boolean = false;

  statement: string = "คำชี้แจง";
  statement1: string = "แบบตรวจสอบการใช้หลักสูตรสถานศึกษาในระดับชั้นเรียนมี 3 ตอน คือตอนที่ 1 โครงสร้างรายวิชา ตอนที่ 2 หน่วยการเรียนรู้และตอนที่ 3 แผนการจัดการเรียนรู้ ให้ศึกษานิเทศก์และผู้ที่เกี่ยวข้องดำเนินการตรวจสอบการใช้หลักสูตรในระดับชั้นเรียน ดังนี้ ตรวจสอบองค์ประกอบของโครงสร้างรายวิชา หน่วยการเรียนรู้และแผนจัดการเรียนรู้ โดยใช้แบบตรวจสอบตามรายการที่กำหนดแล้วเขียนเครื่องหมาย ✓ ลงในช่องผลการตรวจสอบตามความเป็นจริง";
  operaction: string = "ผลการตรวจสอบ";

  section1: string = "ตอนที่ 1 โครงสร้างรายวิชา";
  section2: string = "ตอนที่ 2 หน่วยการเรียนรู้";
  section3: string = "ตอนที่ 3 แผนจัดการเรียนรู้"
  section4: string = "ข้อเสนอแนะอื่น ๆ เพิ่มเติม";

  // ==============================หัวข้อย่อยตอนที่ 1======================================

  typesS1_1: string = "1.1 มีการระบุรหัสวิชา ชื่อรายวิชา กลุ่มสาระการเรียนรู้ ระดับชั้น จำนวนชั่วโมงหรือหน่วยกิตอย่างครบถ้วนชัดเจน";
  typesS1_2: string = "1.2 ชื่อหน่วยการเรียนรู้น่าสนใจ กะทัดรัด ชัดเจน สอดคล้องกับสาระสำคัญ/ความคิดรวบยอด";
  typesS1_3: string = "1.3 การจัดกลุ่มตัวชี้วัด/ผลการเรียนรู้ในแต่ละหน่วยการเรียนรู้มีความสัมพันธ์เชื่อมโยงและสามารถจัดการเรียนรู้ร่วมกันได้";
  typesS1_4: string = "1.4 สาระสำคัญ/ความคิดรวบยอดแสดงให้เห็นแก่นความรู้รวมถึงสาระการเรียนรู้ของตัวชี้วัด/ผลการเรียนรู้ในแต่ละหน่วยการเรียนรู้";
  typesS1_5: string = "1.5 เวลาเรียนในแต่ละหน่วยการเรียนรู้เหมาะสมกับจำนวนตัวชี้วัด/ผลการเรียนรู้ ความยากง่ายของสาระสำคัญและกระบวนการเรียนรู้ที่จะใช้ในการพัฒนาผู้เรียนตามตัวชี้วัด/ผลการเรียนรู้";
  typesS1_6: string = "1.6 น้ำหนัก/สัดส่วนของคะแนนเหมาะสมกับเวลาเรียนความยากง่ายของสาระสำคัญและกระบวนการเรียนรู้ที่จะใช้ในการพัฒนาผู้เรียนตามตัวชี้วัด/ผลการเรียนรู้";
  typesS1_7: string = "1.7 ชิ้นงาน/ภาระงานรวบยอด สอดคล้อง สัมพันธ์ ครอบคลุมและสะท้อนให้เห็นผลการพัฒนาผู้เรียนตามตัวชี้วัด/ผลการเรียนรู้ในแต่ละหน่วยการเรียนรู้";

  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 2======================================

  typesS2_1: string = "2.1 มีการระบุรหัสวิชา ชื่อรายวิชา กลุ่มสาระการเรียนรู้ ระดับชั้น จำนวนชั่วโมงและชื่อหน่วยเรียนรู้อย่างครบถ้วนชัดเจนและสอดคล้องกับโครงสร้างรายวิชา";
  typesS2_2: string = "2.2 มาตรฐานการเรียนรู้/ตัวชี้วัด/ผลการเรียนรู้สมรรถนะสำคัญและคุณลักษณะอันพึงประสงค์มีความสัมพันธ์เชื่อมโยงกัน ";
  typesS2_3: string = "2.3 สาระสำคัญ/ความคิดรวบยอดมีความถูกต้อง สอดคล้องและครอบคลุมมาตรฐาน/ตัวชี้วัด/ผลการเรียนรู้  ";
  typesS2_4: string = "2.4 สาระการเรียนรู้มีความถูกต้องและสอดคล้องกับมาตรฐาน/ตัวชี้วัด/ผลการเรียนรู้";
  typesS2_5: string = "2.5 หลักฐานการเรียนรู้ (ชิ้นงาน/ภาระงาน) สอดคล้องกับมาตรฐานการเรียนรู้/ตัวชี้วัด/ผลการเรียนรู้การวัดและประเมินผลและกิจกรรมการเรียนรู้";
  typesS2_6: string = "2.6 การวัดและประเมินผล เป็นการประเมินตามสภาพจริงใช้วิธีการที่หลากหลาย สอดคล้องกับมาตรฐานการเรียนรู้/ตัวชี้วัด/ผลการเรียนรู้ และกิจกรรมการเรียนรู้ระบุวิธีการเครื่องมือและเกณฑ์การประเมินที่สะท้อนคุณภาพผู้เรียนตามมาตรฐานการเรียนรู้/ตัวชี้วัด/ผลการเรียนรู้";
  typesS2_7: string = "2.7 กิจกรรมการเรียนรู้ใช้รูปแบบ/วิธีการ/เทคนิค/ทักษะกระบวนการตามธรรมชาติของวิชาที่ช่วยพัฒนาผู้เรียนให้บรรลุมาตรฐาน/ตัวชี้วัด/ผลการเรียนรู้ สมรรถนะสำคัญของผู้เรียนและคุณลักษณะอันพึงประสงค์ได้อย่างเหมาะสมและมีประสิทธิภาพสามารถนำพาให้ผู้เรียนสร้างสรรค์ชิ้นงานหรือภาระงานตามที่กำหนด";
  typesS2_8: string = "2.8 สื่อและแหล่งเรียนรู้มีความเหมาะสมกับกิจกรรมการเรียนรู้ของผู้เรียนและเวลาช่วยให้ผู้เรียนเกิดการเรียนรู้ได้ดีและรวดเร็วขึ้น";

  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 3======================================

  typesS3_1: string = "3.1 มีการระบุชื่อแผนการเรียนรู้ชื่อหน่วยการเรียนรู้ รหัสวิชา ชื่อรายวิชา กลุ่มสาระการเรียนรู้ ระดับชั้น จำนวนชั่วโมงอย่างครบถ้วนชัดเจน";
  typesS3_2: string = "3.2 ชื่อแผนจัดการเรียนรู้ น่าสนใจ กะทัดรัด ชัดเจน สอดคล้องกับสาระสำคัญ/ความคิดรวบยอด";
  typesS3_3: string = "3.3 มาตรฐานการเรียนรู้/ตัวชี้วัด/ผลการเรียนรู้ทักษะ/กระบวนการ/สมรรถนะสำคัญและคุณลักษณะอันพึงประสงค์มีความสอดคล้องกัน";
  typesS3_4: string = "3.4 มาตรฐาน/ตัวชี้วัด/ผลการเรียนรู้/จุดประสงค์การเรียนรู้สาระสำคัญ/ความคิดรวบยอด สาระการเรียนรู้และกิจกรรมการเรียนรู้มีความสอดคล้องกัน";
  typesS3_5: string = "3.5 มาตรฐาน/ตัวชี้วัด/ผลการเรียนรู้/จุดประสงค์การเรียนรู้ ครอบคลุมการพัฒนานักเรียนในด้านความรู้หรือทักษะกระบวนการและคุณลักษณะ";
  typesS3_6: string = "3.6 มาตรฐาน/ตัวชี้วัด/ผลการเรียนรู้/จุดประสงค์การเรียนรู้ มีความเหมาะสมกับเวลาสาระการเรียนรู้ วัย และพื้นฐานของผู้เรียน";
  typesS3_7: string = "3.7 มาตรฐาน/ตัวชี้วัด/ผลการเรียนรู้/จุดประสงค์การเรียนรู้ ระบุพฤติกรรมการเรียนรู้ที่คาดหวังในรูปของการแสดงออกหรือการกระทำที่สามารถวัดและประเมินผลได้";
  typesS3_8: string = "3.8 สาระสำคัญ/ความคิดรวบยอดมีความถูกต้อง ชัดเจน กะทัดรัด ครอบคลุมประเด็นสำคัญของสาระการเรียนรู้";
  typesS3_9: string = "3.9 สาระการเรียนรู้เหมาะสมกับเวลา วัย ระดับชั้นและพื้นฐานของผู้เรียน";
  typesS3_10: string = "3.10 สาระการเรียนรู้มีการจัดลำดับความยากง่ายและความต่อเนื่องของเนื้อหาสาระอย่างเหมาะสม/มีการจัดเนื้อหาสาระให้สัมพันธ์กันในลักษณะบูรณาการ";
  typesS3_11: string = "3.11 สาระการเรียนรู้มีความถูกต้อง ทันสมัย เป็นสิ่งจำเป็นและเป็นประโยชน์ต่อผู้เรียนเป็นพื้นฐานในการสร้างข้อความรู้ใหม่หรือทักษะที่ต้องการ";
  typesS3_12: string = "3.12 หลักฐานการเรียนรู้ (ชิ้นงาน/ภาระงาน) ที่กำหนดสอดคล้องกับมาตรฐานการเรียนรู้/ตัวชี้วัด/ผลการเรียนรู้/จุดประสงค์การเรียนรู้ การวัดและประเมินผลและกิจกรรมการเรียนรู้";
  typesS3_13: string = "3.13 หลักฐานการเรียนรู้ (ชิ้นงาน/ภาระงานที่กำหนด) สามารถนำพาให้ผู้เรียนสร้างสรรค์ชิ้นงานหรือภาระงานรวบยอดได้อย่างมีประสิทธิภาพ";
  typesS3_14: string = "3.14 มีการระบุวิธีการ เครื่องมือการวัดและประเมินผลและเกณฑ์การประเมินที่สอดคล้องกับมาตรฐานการเรียนรู้/ตัวชี้วัด/ผลการเรียนรู้/จุดประสงค์การเรียนรู้และกิจกรรมการเรียนรู้";
  typesS3_15: string = "3.15 มีวิธีการวัดและประเมินผลที่หลากหลายและผู้เรียนมีส่วนร่วมในการประเมิน";
  typesS3_16: string = "3.16 กิจกรรมการเรียนรู้มีความหลากหลายโดยใช้ทักษะกระบวนการเรียนรู้ตามธรรมชาติของวิชาและเปิดโอกาสให้ผู้เรียนมีส่วนร่วมในกิจกรรมอย่างทั่วถึง ";
  typesS3_17: string = "3.17 กิจกรรมการเรียนรู้สามารถนำผู้เรียนให้บรรลุจุดประสงค์การเรียนรู้ที่กำหนดไว้ได้อย่างเหมาะสมและมีประสิทธิภาพ";
  typesS3_18: string = "3.18 กิจกรรมการเรียนรู้สามารถนำพาให้ผู้เรียนสร้างสรรค์ชิ้นงานหรือภาระงานที่กำหนดไว้ได้อย่างมีประสิทธิภาพ";
  typesS3_19: string = "3.19 สื่อและแหล่งการเรียนรู้ที่กำหนดมีความเหมาะสมกับกิจกรรมการเรียนรู้ผู้เรียนและเวลาและช่วยให้ผู้เรียนเกิดการเรียนรู้ได้ดีและรวดเร็วขึ้น";
  typesS3_20: string = "3.20 มีบันทึกหลังการสอนที่สะท้อนผลการจัดกิจกรรมพฤติกรรมการเรียนรู้ของผู้เรียน อุปสรรค/ปัญหา/ปัจจัยที่มีผลต่อการจัดกิจกรรมรวมทั้งแนวทางในการแก้ไขปรับปรุงการสอนให้ดีขึ้น";
  // =================================================================================

  
  firstFormGroup = this._formBuilder.group({
    firstCtrl: ['', Validators.required],
  });
  secondFormGroup = this._formBuilder.group({
    secondCtrl: ['', Validators.required],
  });
  thirdFormGroup = this._formBuilder.group({
    fthirdCtrl: ['', Validators.required],
  });
  fourthFormGroup = this._formBuilder.group({
    fourthCtrl: ['', Validators.required],
  });
  

  constructor(private _formBuilder: FormBuilder) {}
}
