import { Component } from '@angular/core';

@Component({
  selector: 'app-mnf-spvs-eleventh',
  templateUrl: './mnf-spvs-eleventh.component.html',
  styleUrls: ['./mnf-spvs-eleventh.component.css']
})
export class MnfSpvsEleventhComponent {
  loading: boolean = false;

  operaction: string = "การดำเนินการ";

  section1: string = "คำชี้แจง โปรดเลือกตอบคำถามในช่องปฏิบัติหรือไม่ปฏิบัติและเขียนอธิบายการดำเนินการเมื่อระบุว่ามีการปฏิบัติให้เห็นภาพการดำเนินการของโรงเรียนในการจัดการขยะและการลดปริมาณขยะในโรงเรียนและชุมชน";
  section2: string = "ข้อเสนอแนะเพิ่มเติม";
  
  // ==============================หัวข้อย่อยตอนที่ 1======================================

  list1: string = "1. โรงเรียนมีนโยบายและระบบการดำเนินการจัดการขยะและลดปริมาณขยะในโรงเรียน";
  list2: string = "2. การจัดการด้านการใช้พลังงานในโรงเรียน low carbon school ของโรงเรียนลดใช้พลังงาน";
  list3: string = "3. การจัดการด้านการใช้น้ำและน้ำทิ้งในโรงเรียน";
  list4: string = "4. การจัดซื้อ/การใช้ผลิตภัณฑ์ และการจัดการขยะในโรงเรียน";
  list5: string = "5. สภาพแวดล้อมและภูมิทัศน์ที่เอื้อต่อการเรียนรู้งานการอนุรักษ์พลังงานและสิ่งแวดล้อม";
  list6: string = "6. โรงเรียนมีการบูรณาการความรู้ด้านการอนุรักษ์พลังงานและสิ่งแวดล้อมในหลักสูตรและกระบวนการเรียนการสอน";
  list7: string = "7. โรงเรียนมีการขยายผลการดำเนินงานด้านอนุรักษ์พลังงานและสู่การจัดการขยะและลดปริมาณขยะในโรงเรียนใกล้เคียงและชุมชน";
  list8: string = "8. บุคลากรครูในโรงเรียนรับทราบเกี่ยวกับนโยบายอนุรักษ์พลังงานและการจัดการขยะและลดปริมาณขยะในโรงเรียน";
  list9: string = "9. บุคลากรอื่น ๆ เช่นนักกาภารโรง ผู้จำหน่ายอาหารในโรงเรียน ฯลฯ รับทราบเกี่ยวกับนโยบายอนุรักษ์พลังงานและการจัดการขยะและลดปริมาณขยะในโรงเรียน";
  list10: string = "10. นักเรียนรับทราบเกี่ยวกับนโยบายอนุรักษ์พลังงานและการจัดการขยะและลดปริมาณขยะในโรงเรียน";
  list11: string = "11. โรงเรียนมีมาตรการลดการใช้โฟมและถุงพลาสติก";
  list12: string = "12. โรงเรียนมีการจัดการและคัดแยกขยะตามแนวคิด 3Rs Reduce Reuse Recycle";
}
