import { Component } from '@angular/core';

@Component({
  selector: 'app-mnf-spvs-tenth',
  templateUrl: './mnf-spvs-tenth.component.html',
  styleUrls: ['./mnf-spvs-tenth.component.css']
})
export class MnfSpvsTenthComponent {
  loading: boolean = false;

  operaction: string = "การดำเนินการ";
  
  section1: string = "รายการที่ 1. การจัดกิจกรรมที่ส่งเสริมผู้เรียนให้เกิดคุณลักษณะตามจุดเน้นคุณลักษณะโรงเรียนสุจริต";
  section2: string = "รายการที่ 2. การนำหลักคุณธรรม จริยธรรมและธรรมาภิบาลไปใช้ในการบริหารงานตามมาตรฐานการบริหารงานโรงเรียนสุจริต";
  section3: string = "รายการที่ 3. การใช้หลักสูตรต้านทุจริตศึกษา (Anti-Corruption Education) ในสถานศึกษา"
  section4: string = "ข้อสังเกต/ข้อเสนอแนะเพิ่มเติม";
  // ==============================หัวข้อย่อยตอนที่ 1======================================

  list1_1: string = "1. การดำเนินการกิจกรรม ป.ป.ช. สพฐ.น้อยและป.ป.ช. สพฐ.ชุมชน";
  list1_2: string = "2. การดำเนินการกิจกรรมบริษัทสร้างการดี";
  list1_3: string = "3. การดำเนินการกิจกรรมสร้างสำนึกพลเมือง (Project Citizen)";
  list1_4: string = "4. การดำเนินการกิจกรรมการผลิตสื่อสร้างสรรค์ต่อต้านการทุจริตผ่านสื่อภาพยนตร์สั้น";
  list1_5: string = "5. การดำเนินการกิจกรรมถอดบทเรียน (Best Practice)";
  list1_6: string = "6. การดำเนินการกิจกรรมค่ายเยาวชนไทยหัวใจ STRONG";
  
  list2_1: string = "1. การบริหารงานด้านวิชาการ";
  list2_2: string = "2. การบริหารงานงบประมาณ";
  list2_3: string = "3. การบริหารงานบุคคล";
  list2_4: string = "4. การบริหารงานทั่วไป";

  list3_1: string = "1. นำไปจัดทำเป็นรายวิชาเพิ่มเติมของโรงเรียน";
  list3_2: string = "2. นำไปใช้ในชั่วโมงลดเวลาเรียนเพิ่มเวลารู้";
  list3_3: string = "3. นำไปบูรณาการกับการจัดการเรียนการสอนในกลุ่มสาระการเรียนรู้สังคมศึกษา ศาสนาและวัฒนธรรม (สาระหน้าที่พลเมือง) หรือบูรณาการกับกลุ่มสาระการเรียนรู้อื่น ๆ";
}
