import { Component } from '@angular/core';

@Component({
  selector: 'app-mnf-spvs-fifth',
  templateUrl: './mnf-spvs-fifth.component.html',
  styleUrls: ['./mnf-spvs-fifth.component.css']
})
export class MnfSpvsFifthComponent {
  loading: boolean = false;

  operaction1: string = "หน่วย/แผนการเรียนรู้";
  operaction2: string = "กิจกรรมพัฒนาผู้เรียน";
  operaction3: string = "โครงการ/กิจกรรม";

  // ==============================หัวข้อตอนที่ 2.2======================================

  list1: string = "1. นำหลักการ เข้าใจ เข้าถึง พัฒนาสู่การพัฒนาผู้เรียน";
  list2: string = "2. นำหลักปรัชญาของเศรษฐกิจพอเพียงสู่การพัฒนาผู้เรียน โดยครูผู้สอนนำหลักปรัชญาของเศรษฐกิจพอเพียงสู่การปฏิบัติ ได้เเก่ ความพอประมาณ ความมีเหตุผล การสร้างภูมิคุ้มกัน เงื่อนไขความรู้ เงื่อนไขคุณธรรม และผู้เรียนมีคุณลักษณะอยู่อย่างพอเพียง ตามหลักปรัชญาของเศรษฐกิจพอเพียง ความพอประมาณ ความมีเหตุผล การสร้างภูมิคุ้มกัน เงื่อนไขความรู้ เงื่อนไขคุณธรรม";
  list3: string = "3. นำหลักการทรงงานไปใช้ในการจัดการเรียนรู้";
  list4: string = "4. การนำศาสตร์พระราชาพัฒนาสมรรถนะที่สำคัญของผู้เรียน";
  list5: string = "5. การนำศาสตร์พระราชาสู่การพัฒนาคุณลักษณะอันพึงประสงค์ของผู้เรียน";
  list6: string = "6. ศาสตร์พระราชาส่งผลต่อผู้เรียนเกิดทักษะดังนี้ ทักษะวิชาการ ทักษะชีวิต ทักษะวิชาชีพ (กรณีมีปัญหา)";
  list7: string = "ข้อเสนอแนะอื่น ๆ เพิ่มเติม (ถ้ามี)";

  // =================================================================================
}
