import { Component } from '@angular/core';

@Component({
  selector: 'app-mnf-spvs-twelfth',
  templateUrl: './mnf-spvs-twelfth.component.html',
  styleUrls: ['./mnf-spvs-twelfth.component.css']
})
export class MnfSpvsTwelfthComponent {
  loading: boolean = false;

  operaction: string = "การจัดทำคู่มือวัดและประเมินผลประกอบหลักสูตร";

  section1: string = "คำชี้แจง เอกสารฉบับนี้จัดทำขึ้นเพื่อนิเทศ ติดตาม สร้างเครือข่ายการดำเนินงานวัดผลและประเมินผลการศึกษา เพื่อใช้การวางแผนพัฒนาคุณภาพการวัดผลประเมินการศึกษาของโรงเรียนในสังกัดสำนักงานเขตพื้นที่การศึกษามัธยมศึกษาสกลนคร";

  unit1: string = "1. ด้านสภาพการดำเนินงานและความต้องการพัฒนาด้านการวัดผลและประเมินผล";
  unit2: string = "2. เครือข่ายผู้ปฏิบัติงานด้านการวัดผลและประเมินผล";
  
  // ==============================หัวข้อย่อยตอนที่ 1======================================

  subUnit1_1: string = "1.1 การจัดทำคู่มือวัดและประเมินผลตามหลักสูตร";
  subUnit1_2: string = "1.2 การจัดทำสรุปผลสัมฤทธิ์ทางการเรียนรายภาค รายปี";
  subUnit1_3: string = "1.3 ความต้องการความร่วมมือ การพัฒนาความรู้ ด้านการวัดและประเมินผลกับ สพม.สกลนคร";
  subUnit1_4: string = "1.4 ปัญหา/ข้อเสนอแนะ ในการดำเนินการวัดและประเมินผลในสถานศึกษา";
 
  subUnit2_1: string = "2.1 เจ้าหน้าที่ประสานการดำเนินการจัดสอบ O-NET";
  sub_sub_Unit2_1: string = "1) การจัดสอบ O-NET ชั้นมัธยมศึกษาปีที่ 3";
  sub_sub_Unit2_2: string = "2) การจัดสอบ O-NET ชั้นมัธยมศึกษาปีที่ 6";

  subUnit2_2: string = "2.2 เจ้าหน้าที่ประสานการการส่งผลการเรียนเฉลี่ย (GPAX)";
  
}
