import { Component } from '@angular/core';

@Component({
  selector: 'app-mnf-spvs-seventh',
  templateUrl: './mnf-spvs-seventh.component.html',
  styleUrls: ['./mnf-spvs-seventh.component.css']
})
export class MnfSpvsSeventhComponent {
  loading: boolean = false;

  operaction: string = "การปฏิบัติ";

  section1: string = "ตอนที่ 1 การแต่งตั้งคณะกรรมการขับเคลื่อนกระบวนการ PLC ระดับสถานศึกษา";
  section2: string = "ตอนที่ 2 การกำหนดแผนงานการขับเคลื่อนกระบวนการ PLC ระดับสถานศึกษา";
  section3: string = "ตอนที่ 3 การขับเคลื่อนกระบวนการ PPLC สู่การปฏิบัติในสถานศึกษา"
  section4: string = "ตอนที่ 4 กิจกรรม PPLC ที่สามารถเป็น Best practice ของแต่ละกลุ่มสาระการเรียนรู้/กลุ่มกิจกรรมพัฒนาผู้เรียน (ในแต่ละกลุ่มสาระการเรียนรู้อาจจะมีมากกว่า 1 กิจกรรม)";

  // ==============================หัวข้อย่อยตอนที่ 1======================================

  typesS1_1: string = "1.1 จัดทำคำสั่งแต่งตั้งคณะกรรมการขับเคลื่อนกระบวนการ PPLC (Piboon Professional Learning Community) ระดับสถานศึกษา";
  typesS1_2: string = "1.2 การกำหนดบทบาทหน้าที่คณะกรรมการขับเคลื่อนกระบวนการ PPLC (Piboon Professional Learning Community) ที่ชัดเจน";

  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 2======================================

  typesS2_1: string = "2.1 การจัดทำแผนงานการขับเคลื่อนกระบวนการ PPLC (Piboon Professional Learning Community) ระดับสถานศึกษา";
  typesS2_2: string = "2.2 การสร้างทีมงาน PPLC (Piboon Professional Learning Community) ระดับกลุ่มสาระ/ช่วงชั้น/ระดับชั้น";
  typesS2_3: string = "2.3 การสร้างเครือข่ายกับหน่วยงานอื่น (เช่น มหาวิทยาลัย/หน่วยงานเอกชน/อื่น ๆ) พร้อมระบุว่าเข้ามาสนับสนุนเรื่องใดบ้าง";

  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 3======================================

  typesS3_1: string = "3.1 การกำหนดชั่วโมงในกระบวนการ PPLC (Piboon Professional Learning Community) โดยแยกตามทีมงาน PPLC แต่ละกลุ่มที่ปฏิบัติจริง";
  typesS3_2: string = "3.2 การสร้างความตระหนัก/ความรู้ความเข้าใจและแนวทางของกระบวนการ PPLC ให้กับบุคลากรในสถานศึกษา";
  typesS3_3: string = "3.3 การกำหนดเป้าหมายในการจัดการเรียนรู้ร่วมกัน (อาจมีมากกว่า 1 ข้อ ตามบริบทของแต่ละกลุ่มแต่ยังคงตอบสนองนโยบายของสถานศึกษา)";
  typesS3_4: string = "3.4 การนำกระบวนการ PPLC เข้าสู่ห้องเรียน (การพูดคุยประเด็นก่อนการเข้าสอน/ก่อนนำแผนการจัดการเรียนรู้เพื่อนำไปสอนในห้องเรียน การสังเกตการสอน การสะท้อนผลหลังสอน)";
  typesS3_5: string = "3.5 การนำกระบวนการ PPLC มาจัดทำวิจัยในชั้นเรียน";
  
  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 4======================================

  typesS4_1: string = "4.1 กลุ่มสาระการเรียนรู้ ภาษาไทย";
  typesS4_2: string = "4.2 กลุ่มสาระการเรียนรู้ ภาษาต่างประเทศ";
  typesS4_3: string = "4.3 กลุ่มสาระการเรียนรู้ คณิตศาสตร์";
  typesS4_4: string = "4.4 กลุ่มสาระการเรียนรู้ วิทยาศาสตร์";
  typesS4_5: string = "4.5 กลุ่มสาระการเรียนรู้ สังคมศึกษา ศาสนาและวัฒนธรรม";
  typesS4_6: string = "4.6 กลุ่มสาระการเรียนรู้ สุขศึกษาและพลศึกษา";
  typesS4_7: string = "4.7 กลุ่มสาระการเรียนรู้ การงานอาชีพ และเทคโนโลยี";
  typesS4_8: string = "4.8 กลุ่มสาระการเรียนรู้ ศิลปะ";
  typesS4_9: string = "4.9 กลุ่มกิจกรรมพัฒนาผู้เรียน";
  
  // =================================================================================

  
}
