import { Component } from '@angular/core';
import { FormBuilder, Validators } from '@angular/forms';

@Component({
  selector: 'app-mnf-spvs-first',
  templateUrl: './mnf-spvs-first.component.html',
  styleUrls: ['./mnf-spvs-first.component.css']
})
export class MnfSpvsFirstComponent {
  loading: boolean = false;

  operaction: string = "ผลการตรวจสอบ";

  statement: string = "คำชี้แจง แบบตรวจสอบการพัฒนาหลักสูตรสถานศึกษา ฉบับนี้ มี 2 ตอน โดยศึกษานิเทศก์และผู้ที่เกี่ยวข้องตรวจสอบการจัดทำองค์ประกอบหลักสูตรสถานศึกษา ดังนี้";
  statement1: string = "1. ตรวจสอบองค์ประกอบหลักสูตรสถานศึกษาตามรายการที่กำหนดแล้วเขียนเครื่องหมาย ✓ ลงในช่องผลการตรวจสอบตามความเป็นจริง";
  statement2: string = "2. บันทึกข้อสังเกต/ข้อเสนอแนะในการปรับปรุง/แก้ไขแต่ละรายการเพื่อให้โรงเรียนนำไปใช้ประโยชน์ในการปรับปรุงและพัฒนาหลักสูตรสถานศึกษาต่อไป";
  statement3: string = "3. บันทึกข้อเสนอแนะเพิ่มเติม (ถ้ามี)";

  unit1: string = "ตอนที่ 1 การตรวจสอบองค์ประกอบของหลักสูตรสถานศึกษา: กรอบสาระท้องถิ่นมาตรฐานสากลจุดเน้นการจัดการศึกษาเพื่อการมีงานทำ";
  unit2: string = "ตอนที่ 2 ข้อเสนอแนะอื่นเพิ่มเติม ๆ (ถ้ามี)";

  section1: string = "1. ส่วนนำ";
  section2: string = "2. โครงสร้างหลักสูตรสถานศึกษา";
  section3: string = "3. คำอธิบายรายวิชา"
  section4: string = "4. กิจกรรมพัฒนาผู้เรียน";
  section5: string = "5. เกณฑ์การจบการศึกษา";
  section6: string = "6. ข้อเสนอแนะอื่น ๆ เพิ่มเติม";

  // ==============================หัวข้อย่อยตอนที่ 1======================================

  typesS1_1: string = "1.1 ความนำ";
  typesSubS1_1_1: string = "แสดงความเชื่อมโยงระหว่างหลักสูตรแกนกลางการศึกษาขั้นพื้นฐานพุทธศักราช 2551 และฉบับปรับปรุง พ.ศ. 2560 กรอบหลักสูตรระดับท้องถิ่น จุดเน้นและความต้องการของโรงเรียน";

  typesS1_2: string = "1.2 วิสัยทัศน์";
  typesSubS1_2_1: string = "1.2.1 แสดงภาพอนาคตของผู้เรียนที่สอดคล้องกับวิสัยทัศน์ของหลักสูตรแกนกลางการศึกษาขั้นพื้นฐานพุทธศักราช 2551 ประเทศไทย 4.0 โลกในศตวรรษที่ 21 และทัดเทียมกับนานาชาติ";
  typesSubS1_2_2: string = "1.2.2 แสดงภาพอนาคตของผู้เรียนสอดคล้องกับกรอบหลักสูตรระดับท้องถิ่น";
  typesSubS1_2_3: string = "1.2.3 แสดงภาพอนาคตของผู้เรียนครอบคลุมสภาพความต้องการของโรงเรียน ชุมชน ท้องถิ่น ฯลฯ";
  typesSubS1_2_4: string = "1.2.4 มีความชัดเจนสามารถปฏิบัติได้";

  typesS1_3: string = "1.3 สมรรถนะสำคัญของผู้เรียน";
  typesSubS1_3_1: string = "มีความสอดคล้องกับหลักสูตรแกนกลางการศึกษาขั้นพื้นฐานพุทธศักราช 2551";

  typesS1_4: string = "1.4 คุณลักษณะอันพึงประสงค์";
  typesSubS1_4_1: string = "1.4.1 มีความสอดคล้องกับหลักสูตรแกนกลางการศึกษาขั้นพื้นฐานพุทธศักราช 2551";
  typesSubS1_4_2: string = "1.4.2 มีความสอดคล้องกับเป้าหมายและจุดเน้นของกรอบหลักสูตรระดับท้องถิ่นและโรงเรียน เช่น โรงเรียนในเขตพื้นที่พิเศษ โรงเรียนชายแดน โรงเรียนวัตถุประสงค์พิเศษ ฯลฯ";
  typesSubS1_4_3: string = "1.4.3 สอดคล้องกับวิสัยทัศน์ของโรงเรียน";
  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 2======================================

  typesS2_1: string = "2.1 รายวิชาพื้นฐาน";
  typesSubS2_1_1: string = "2.1.1 ระบุรายวิชาพื้นฐาน 8 กลุ่มสาระการเรียนรู้ตามหลักสูตรแกนการศึกษาขั้นพื้นฐาน จำแนกแต่ละชั้นปี / ช่วงชั้น (ม.ปลาย) อย่างชัดเจน";
  typesSubS2_1_2: string = "2.1.2 บูรณาการกรอบสาระท้องถิ่นกับรายวิชาพื้นฐาน 8 กลุ่มสาระการเรียนรู้จำแนกแต่ละชั้นปี / ช่วงชั้น (ม.ปลาย) อย่างชัดเจน";
  typesSubS2_1_3: string = "2.1.3 บูรณการการจัดการศึกษาเพื่อการมีงานทำกับรายวิชาพื้นฐาน 8 กลุ่มสาระการเรียนรู้จำแนกแต่ละชั้นปี / ช่วงชั้น (ม.ปลาย) อย่างชัดเจน";

  typesS2_2: string = "2.2 รายวิชาเพิ่มเติม ";
  typesSubS2_2_1: string = "2.2.1 ระบุรายวิชาเพิ่มเติม จำแนกแต่ละชั้นปี / ช่วงชั้น (ม.ปลาย) อย่างชัดเจน";
  typesSubS2_2_2: string = "2.2.2 มีระบุรายวิชาเพิ่มเติม Independent Study: IS";
  typesSubS2_2_3: string = "2.2.3 มีระบุรายวิชาเพื่อการมีงานทำ";
  typesSubS2_2_4: string = "2.2.4 มีระบุรายวิชาตามความสนใจของนักเรียน";

  typesS2_3: string = "2.3 โครงสร้างหลักสูตรชั้นปี";
  typesSubS2_3_1: string = "2.3.1 มีการระบุรายวิชาพื้นฐานทั้ง 8 กลุ่มสาระการเรียนรู้พร้อมทั้งระบุเวลาเรียนหรือหน่วยกิต";
  typesSubS2_3_2: string = "2.3.2 มีการระบุรายวิชาเพิ่มเติมที่สถานศึกษากำหนดพร้อมทั้งระบุเวลาเรียนหรือหน่วยกิต";
  typesSubS2_3_3: string = "2.3.3 มีการระบุกิจกรรมพัฒนาผู้เรียน พร้อมทั้งระบุเวลาเรียนตามเกณฑ์ที่หลักสูตรแกนกลางการศึกษาขั้นพื้นฐานพุทธศักราช 2551";
  typesSubS2_3_4: string = "2.3.4 มีรายวิชาพื้นฐานและรายวิชาเพิ่มเติมที่ระบุรหัสวิชาและชื่อรายวิชาไว้อย่างถูกต้องชัดเจน ";
  typesSubS2_3_5: string = "2.3.5 มีรายวิชาเพิ่มเติม/กิจกรรมเพิ่มเติม สอดคล้องกับวิสัยทัศน์และจุดเน้นของโรงเรียน ";

  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 3======================================

  typesS3_1: string = "3.1 มีการระบุรหัสวิชา ชื่อรายวิชาและชื่อกลุ่มสาระการเรียนรู้ไว้อย่างถูกต้องชัดเจน";
  typesS3_2: string = "3.2 มีการระบุชั้นปี/ภาคเรียนที่สอน (ระดับมัธยมศึกษา) และจำนวนเวลาเรียนหรือหน่วยกิตไว้อย่างถูกต้องชัดเจน";
  typesS3_3: string = "3.3 การเขียนคำอธิบายรายวิชาเขียนเป็นความเรียงโดยระบุองค์ความรู้ทักษะกระบวนการและคุณลักษณะหรือเจตคติที่ต้องการ";
  typesS3_4: string = "3.4 มีการจัดทำคำอธิบายรายวิชาพื้นฐานครอบคลุมตัวชี้วัดสาระการเรียนรู้แกนกลาง";
  typesS3_5: string = "3.5 มีการระบุรหัสตัวชี้วัดในรายวิชาพื้นฐานและจำนวนรวมของตัวชี้วัด";
  typesS3_6: string = "3.6 มีการระบุผลการเรียนรู้ในรายวิชาเพิ่มเติมและจำนวนรวมของผลการเรียนรู้";
  typesS3_7: string = "3.7 มีการกำหนดสาระการเรียนรู้ท้องถิ่นสอดแทรกอยู่ในคำอธิบายรายวิชาพื้นฐานหรือรายวิชาเพิ่มเติม";
  
  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 4======================================

  typesS4_1: string = "4.1 จัดกิจกรรมทั้ง 3 กิจกรรม (กิจกรรมแนะแนว กิจกรรมนักเรียน และกิจกรรมเพื่อสังคมและสาธารณประโยชน์) ตามที่กำหนดไว้ในหลักสูตรแกนกลางการศึกษาขั้นพื้นฐานพุทธศักราช 2551";
  typesS4_2: string = "4.2 จัดเวลาเรียนกิจกรรมพัฒนาผู้เรียนสอดคล้องกับโครงสร้างเวลาเรียนที่หลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน พุทธศักราช 2551";
  typesS4_3: string = "4.3 มีแนวทางการจัดกิจกรรมพัฒนาผู้เรียนที่ชัดเจนทุกกิจกรรม";
  typesS4_4: string = "4.4 มีแนวทางการประเมินผลกิจกรรมพัฒนาผู้เรียนที่ชัดเจนสอดคล้องกับแนวทางการจัดกิจกรรมพัฒนาผู้เรียน";
  
  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 5======================================

  typesS5_1: string = "5.1 มีการระบุเวลาเรียน/หน่วยกิต รายวิชาพื้นฐานและรายวิชาเพิ่มเติมอย่างชัดเจนสอดคล้องกับโครงสร้างหลักสูตรของโรงเรียน สอดคล้องกับเกณฑ์การจบการศึกษาตามหลักสูตรแกนกลางการศึกษาขั้นพื้นฐานพุทธศักราช 2551 ";
  typesSubS5_5_1: string = "5.1.1 ระดับมัธยมศึกษาตอนต้น ได้หน่วยกิตตลอดหลักสูตรไม่น้อยกว่า 77 หน่วยกิต โดยเป็นรายวิชาพื้นฐาน 66 หน่วยกิตและรายวิชาเพิ่มเติมไม่น้อยกว่า 11 หน่วยกิต";
  typesSubS5_5_2: string = "5.1.2 ระดับมัธยมศึกษาตอนปลาย ได้หน่วยกิตตลอดหลักสูตรไม่น้อยกว่า 77 หน่วยกิต โดยเป็นรายวิชาพื้นฐาน 41 หน่วยกิตและรายวิชาเพิ่มเติมไม่น้อยกว่า 36 หน่วยกิต";

  typesS5_2: string = "5.2 มีการระบุเกณฑ์การประเมินการอ่านคิด วิเคราะห์และเขียนไว้อย่างชัดเจน";
  typesS5_3: string = "5.3 มีการระบุเกณฑ์การประเมินคุณลักษณะอันพึงประสงค์ไว้อย่างชัดเจน";
  typesS5_4: string = "5.4 มีการระบุเกณฑ์การผ่านกิจกรรมพัฒนาผู้เรียนไว้อย่างชัดเจน";
  
  // =================================================================================

  firstFormGroup = this._formBuilder.group({
    firstCtrl: ['', Validators.required],
  });
  secondFormGroup = this._formBuilder.group({
    secondCtrl: ['', Validators.required],
  });
  thirdFormGroup = this._formBuilder.group({
    fthirdCtrl: ['', Validators.required],
  });
  fourthFormGroup = this._formBuilder.group({
    fourthCtrl: ['', Validators.required],
  });
  fifthFormGroup = this._formBuilder.group({
    fifthCtrl: ['', Validators.required],
  });
  sixthFormGroup = this._formBuilder.group({
    sixthCtrl: ['', Validators.required],
  });

  constructor(private _formBuilder: FormBuilder) {}
}
