import { Component } from '@angular/core';
import { FormBuilder, Validators } from '@angular/forms';

@Component({
  selector: 'app-mnf-tk-fourth',
  templateUrl: './mnf-tk-fourth.component.html',
  styleUrls: ['./mnf-tk-fourth.component.css']
})
export class MnfTkFourthComponent {
  loading: boolean = false;

  operaction: string = "ความสำเร็จผลประเมินของโรงเรียน (เต็ม 5 คะเเนน)";

  // ==============================หัวข้อตอนที่ 2.4.1======================================

  list1: string = "1. Uninet ของโรงเรียนใช้งานได้";
  list2: string = "2. โรงเรียนมีการจัดการเรียนรู้โดยใช้แท็บเล็ตในระดับชั้น ม.2";
  list3: string = "3. โรงเรียนมีการใช้เทคโนโลยีสารสนเทศในการบริหารจัดการ เช่น โทรศัพท์ โทรสาร คอมพิวเตอร์ สมาร์ทโฟน อินเทอร์เน็ต เว็บไซต์โรงเรียน  เป็นต้น ";
  list4: string = "4. โรงเรียนส่งเสริมใช้โปรแกรมกราฟิกในการสร้างสื่อการเรียนการสอน";
  list5: string = "5. โรงเรียนมีการส่งเสริมให้นักเรียนใช้โปรแกรมบันทึกภาพและเสียงจากคอมพิวเตอร์";
  list6: string = "6. ครูส่งเสริมให้นักเรียนนำเสนอผลงานโดยใช้คอมพิวเตอร์";
  list7: string = "7. มีการใช้คอมพิวเตอร์ในการติดต่อสื่อสารระหว่างนักเรียนกับนักเรียนและระหว่างครูกับนักเรียนในการแลกเปลี่ยนเรียนรู้";
  list8: string = "8. มีการถ่ายโอนข้อมูลรูปแบบต่าง ๆ ไปยังอุปกรณ์อื่นๆโดยใช้คอมพิวเตอร์";
  list9: string = "9. นักเรียนใช้ Internet ในการสืบค้นข้อมูลได้";
  list10: string = "10. นักเรียนสามารถการใช้งานโปรแกรมพื้นฐาน เช่น โปรแกรม Word หรือ Excel หรือ PowerPoint ส่งงานหรือนำเสนอชิ้นงานได้เช่น ชิ้นงานที่นักเรียนส่งครู รายงานต่าง ๆ";

  // =================================================================================

  // ==============================หัวข้อตอนที่ 2.4.2======================================

  list21: string = "1. โรงเรียนมีความพร้อมทางด้าน Internet";
  list22: string = "2. โรงเรียนส่งเสริม สนับสนุน พัฒนาคุณภาพการศึกษา ให้ครูใช้แหล่งเรียนรู้ผ่านเทคโนโลยีสารสนเทศ (DLIT)";
  list23: string = "3. ครูสามารถเข้าถึงเว็บไซต์ DLIT (www.dlit.ac.th)ได้";
  list24: string = "4. ครูสามารถดาวโหลดเครื่องมือและเนื้อหาที่ต้องการจาก www.dlit.ac.th มาใช้ประโยชน์ในการจัดการเรียนการสอน";
  list25: string = "5. DLIT เป็นเครื่องมือที่มีเนื้อหาและเทคโนโลยีสำหรับการพัฒนาคุณภาพการศึกษา";
  list26: string = "6. DLIT มีเนื้อหาที่ตอบสนองความต้องการและการใช้งานในกิจกรรมการสอนของครูและกิจกรรมการเรียนของนักเรียน";
  list27: string = "7. DLIT เป็นเครื่องมือที่เปิดบริการให้สำหรับทุกคนสามารถเรียนรู้ได้ด้วยตนเองได้ทุกที่ทุกเวลา";
  list28: string = "8. ครูมีความพึงพอใจในการใช้ DLIT เป็นเครื่องมือในการจัดการเรียนรู้";
  list29: string = "9. ผลสัมฤทธิ์ทางการเรียนหลังจากใช้สื่อการเรียนการสอน DLTV";
  list20: string = "10. การใช้ DLTV เหมะสมกับบริบทของสถานศึกษาของท่าน";

  // =================================================================================

  constructor(private _formBuilder: FormBuilder) {}

  firstFormGroup = this._formBuilder.group({
    firstCtrl: ['', Validators.required],
  });
  secondFormGroup = this._formBuilder.group({
    secondCtrl: ['', Validators.required],
  });
}
