import { Component } from '@angular/core';
import { FormBuilder, Validators } from '@angular/forms';

@Component({
  selector: 'app-mnf-spvs-third',
  templateUrl: './mnf-spvs-third.component.html',
  styleUrls: ['./mnf-spvs-third.component.css']
})
export class MnfSpvsThirdComponent {
  loading: boolean = false;

  statement: string = "คำชี้แจง";
  statement1: string = "โปรดกรอกข้อมูลลงในช่องปฏิบัติ หรือ ไม่ปฏิบัติ และอธิบายการดำเนินการปฏิบัติหรือเอกสารหลักฐานประกอบ";
  operaction: string = "ผลการดำเนินการ";

  section1: string = "ตอนที่ 1 รายวิชาวิทยาการคำนวณมีการจัดการเรียนรู้รายวิชาวิทยาการคำนวณ";
  section2: string = "ตอนที่ 2 รายวิชาออกแบบเทคโนโลยี";
  section3: string = "ตอนที่ 3 รายวิชาเกี่ยวข้องกับหุ่นยนต์";
  section4: string = "ข้อเสนอแนะเพิ่มเติม";

  // ==============================หัวข้อย่อยตอนที่ 1======================================

  typesS1_1: string = "1.1 ดำเนินการจัดทำโครงสร้างเวลาเรียนและคำอธิบายรายวิชาตามหลักสูตรแกนกลาง 2551 ฉบับปรับปรุง 2560";
  typesS1_2: string = "1.2 ดำเนินการจัดทำแผนการจัดการเรียนรู้รายวิชา";
  typesS1_3: string = "1.3 ดำเนินการเก็บรวบรวมและสรุปผลที่เกิดจากการจัดการเรียนรู้ในชั้นเรียน";
  typesS1_4: string = "1.4 ดำเนินการเก็บรวบรวมและสรุปผลที่เกิดจากการจัดการเรียนรู้กับผู้เรียน";
  typesS1_5: string = "1.5 โรงเรียนมีรายวิชาที่เกี่ยวข้องหรือมีเนื้อหาที่สอดคล้องกับรายวิชาวิทยาการคำนวณ";

  // =================================================================================

  // ==============================หัวข้อย่อยตอนที่ 2======================================

  typesS2_1: string = "2.1 ดำเนินการจัดทำโครงสร้างเวลาเรียนและคำอธิบายรายวิชา ตามหลักสูตรแกนกลาง 2551 ฉบับปรับปรุง 2560";
  typesS2_2: string = "2.2 ดำเนินการจัดทำแผนการจัดการเรียนรู้รายวิชา";
  typesS2_3: string = "2.3 ดำเนินการเก็บรวบรวมและสรุปผลที่เกิดจากการจัดการเรียนรู้ในชั้นเรียน";
  typesS2_4: string = "2.4 ดำเนินการเก็บรวบรวมและสรุปผลที่เกิดจากการจัดการเรียนรู้กับผู้เรียน";
  typesS2_5: string = "2.5 โรงเรียนมีรายวิชาที่เกี่ยวข้องหรือมีเนื้อหาที่สอดคล้องกับรายวิชาออกแบบเทคโนโลยี";
  typesS2_6: string = "2.6 ดำเนินการจัดการเรียนรู้ที่มีการบูรณาการวิทยาการคำนวณ ออกแบบเทคโนโลยีและบูรณาการเทคโนโลยีหุ่นยนต์";
  typesS2_7: string = "2.7 รายวิชาเกี่ยวข้องกับหุ่นยนต์";

  // ====================================================================================================================

  
  firstFormGroup = this._formBuilder.group({
    firstCtrl: ['', Validators.required],
  });
  secondFormGroup = this._formBuilder.group({
    secondCtrl: ['', Validators.required],
  });
  thirdFormGroup = this._formBuilder.group({
    fthirdCtrl: ['', Validators.required],
  });
  

  constructor(private _formBuilder: FormBuilder) {}
}
