import { Component } from '@angular/core';

@Component({
  selector: 'app-mnf-tk-second',
  templateUrl: './mnf-tk-second.component.html',
  styleUrls: ['./mnf-tk-second.component.css']
})
export class MnfTkSecondComponent {
  loading: boolean = false;
  operaction: string = "การปฏิบัติของโรงเรียน";

  // ==============================หัวข้อตอนที่ 2.2======================================

  list1: string = "1. โรงเรียนจัดทำแผนการนิเทศภายในเพื่อเตรียมความพร้อมในการดำเนินการระบบนิเทศภายในอย่างชัดเจน";
  list2: string = "2. โรงเรียนมีการศึกษาสภาพปัจจุบันปัญหาและความต้องการการนิเทศของครูและบุคลากร";
  list3: string = "3. โรงเรียนมีการวิเคราะห์สภาพปัญหาและร่วมกันหาเเนวทางการเเก้ไขปัญหาด้วยกระบวนการนิเทศภายใน";
  list4: string = "4. โรงเรียนมีวิธีการสร้างความรู้ความเข้าใจและส่งเสริมให้ครูมีความตระหนักถึงความสำคัญของการนิเทศภายใน";
  list5: string = "5. โรงเรียนมีการประเมินผลและติดตามกระบวนการนิเทศภายในอย่างเป็นระบบและต่อเนื่อง";
  list6: string = "6. โรงเรียนนำผลการประเมินการนิเทศภายในมาสะท้อนผลให้ครูร่วมกันรับฟังและเสนอแนะแนวทางแก้ไขปัญหา (กรณีมีปัญหา)";
  list7: string = "7. โรงเรียนมีการส่งเสริมให้นำกระบวนการ PLC มาบูรณาการในกระบวนการนิเทศภายในเพื่อแก้ไขปัญหาการเรียนการสอนและส่งเสริมให้ครูมีผลงานการวิจัยในชั้นเรียน";
  list8: string = "8. โรงเรียนมีเครื่องมือในการเข้าเยี่ยมชั้นเรียนที่ตรงประเด็นการเยี่ยมชั้นเรียน";
  list9: string = "9. โรงเรียนมีการจัดทำสารสนเทศเกี่ยวกับคุณภาพผู้เรียนเพื่อนำเสนอต่อครูและบุคลากรในโรงเรียน";

  // =================================================================================
}
