import { Component } from '@angular/core';

@Component({
  selector: 'app-mnf-spvs-ninth',
  templateUrl: './mnf-spvs-ninth.component.html',
  styleUrls: ['./mnf-spvs-ninth.component.css']
})
export class MnfSpvsNinthComponent {
  loading: boolean = false;

  operaction: string = "การดำเนินการ/ปฏิบัติ";
  
  section1: string = "ประเด็นที่ 1. การส่งเสริมนิสัยรักการอ่านละบูรณาการการอ่านทุกกลุ่มสาระการเรียนโดยใช้สื่อการอ่านของห้องสมุด จัดกิจกรรมที่หลากหลาย มีการพัฒนาสื่อการอ่านวิจัยและนวัตกรรมการอ่าน ให้เหมาะสมกับวัยของผู้เรียน ตามเกณฑ์ที่ สพฐ.กำหนด";
  section2: string = "ประเด็นที่ 2. การพัฒนาห้องสมุดโรงเรียนเรียนให้เป็นห้องสมุดมีชีวิตมีระบบ Digital Library มีสื่อการอ่านที่หลากหลายมีคุณภาพและปริมาณเพียงพอและเหมาะสมกับผู้เรียน";
  section3: string = "ประเด็นที่ 3. การสร้างเครือข่ายความร่วมมือเพื่อช่วยกันพัฒนาทักษะการอ่าน ในการส่งเสริมนิสัยรักการอ่านของผู้เรียน และพัฒนาห้องสมุดของโรงเรียน"
  section4: string = "ประเด็นที่ 4. การเตรียมความพร้อมในเข้าร่วมคัดเลือกห้องสมุดดีเด่นห้องสมุดต้นแบบ สำนักงานเขตพื้นที่การศึกษามัธยมศึกษาสกลนคร มีวิธีการดำเนินการอย่างไรและมีความพร้อมในการเข้ารับคัดเลือกห้องสมุดต้นแบบดีเด่นมากน้อยเพียงใด";
  // ==============================หัวข้อย่อยตอนที่ 1======================================

  list1_1: string = "1. นักเรียนระดับมัธยมศึกษาปีที่ 1-6 เลือกอ่านหนังสือ/สื่อตามความสนใจและสื่อสารเรื่องที่อ่านให้ผู้อื่นเข้าใจโดยการพูด เขียน แสดงความคิดเห็น วิเคราะห์สังเคราะห์ สร้างสรรค์ ประเมินค่าและนำข้อคิดไปประยุกต์ใช้แก้ปัญหาในการดำเนินชีวิต";
  list1_2: string = "2. นักเรียนอ่านหนังสือต่อปี (ไม่รวมหนังสือเรียน)";
  list1_3: string = "3. นักเรียนอ่านนอกเวลาเรียน";
  list1_4: string = "4. นักเรียนใช้บริการห้องสมุดในการศึกษาค้นคว้าและการพัฒนาการอ่าน";
  list1_5: string = "5. นักเรียนทุกระดับชั้นเข้าร่วมกิจกรรมส่งเสริมการอ่านหรือสมัครใจเป็นสมาชิกชมรม/ชุมนุมห้องสมุดหรือยุวบรรณารักษ์";
  list1_6: string = "6. ครูผู้สอนครูหรือบุคลากรที่ทำหน้าที่บรรณารักษ์ร่วมกันจัดกิจกรรมส่งเสริมการอ่านอย่างต่อเนื่องและเกิดประสิทธิภาพ";
  list1_7: string = "7. ครูผู้สอนครูหรือบุคลากรที่ทำหน้าที่บรรณารักษ์มีการบูรณาการการอ่านในทุกกลุ่มสาระการเรียนรู้ทั้งในห้องเรียนและนอกห้องเรียน";
  list1_8: string = "8. ครูบรรณารักษ์ ครูหรือบุคลากรที่ทำหน้าที่บรรณารักษ์มีการพัฒนาคุณภาพงานในรูปแบบ PLC";
  
  list2_1: string = "1. โรงเรียนบริหารแผนงาน/โครงการส่งเสริมนิสัยรักการอ่านได้บรรลุวัตถุประสงค์และเป้าหมายอย่างชัดเจน";
  list2_2: string = "2. โรงเรียนจัดห้องสมุดมีชีวิตตามมาตรฐานห้องสมุดโรงเรียนของ สพฐ.";
  list2_3: string = "3. ห้องสมุดโรงเรียนมีสื่อการอ่านและนวัตกรรมการอ่านที่มีคุณภาพ";
  list2_4: string = "4. ห้องสมุดโรงเรียนจัดกิจกรรมส่งเสริมการอ่าน เช่น ค่ายการอ่าน สัปดาห์ห้องสมุด วันรักการอ่าน ฯลฯ";
  list2_5: string = "5. การพัฒนาห้องสมุดโรงเรียนให้ทันสมัยเป็นห้องสมุดมีชีวิตมีระบบ Digital Library";
  list2_6: string = "6. โรงเรียนประกาศเกียรติคุณ ผู้บริหาร ครูผู้สอน ครูหรือบุคลากรที่ทำหน้าที่บรรณารักษ์นักเรียนรักการอ่าน";

  list3_1: string = "1. โรงเรียนมีเครือข่ายความร่วมมือช่วยเหลือซึ่งกันและกันเพื่อพัฒนาทักษะทางภาษาส่งเสริมนิสัยรักการอ่านและห้องสมุดมีชีวิต";
  list3_2: string = "2. โรงเรียนมีการนิเทศ กำกับ ติดตาม ประเมินผลและจัดทำข้อมูลสารสนเทศ";
  
  // =================================================================================

}
