import { Component } from '@angular/core';

@Component({
  selector: 'app-mnf-spvs-sixth',
  templateUrl: './mnf-spvs-sixth.component.html',
  styleUrls: ['./mnf-spvs-sixth.component.css']
})
export class MnfSpvsSixthComponent {
  loading: boolean = false;

  statement: string = "คำชี้แจง";
  statement1: string = "โปรดทำแบบนิเทศ ติดตามการจัดกิจกรรมการเรียนรู้แบบ Active Learning โดยใช้ตารางเมททริกซ์ข้อค้นพบการพัฒนาการจัดกิจกรรมการเรียนรู้แบบ ActiveLearning ของครูรายบุคคล/รายภาคเรียน โดยการกำหนดคะแนนเพื่อเป็นตัวแทนการปฏิบัติงานของครู ดังนี้";

  section1: string = "ด้านครูผู้สอน";
  section2: string = "ด้านผู้เรียน";
  section3: string = "ด้านกระบวนการ";

  t1: string = "ครูหนึ่ง";
  t2: string = "ครูสอง";
  t3: string = "ครูสาม";

  list1: string = "1. สร้างบรรยากาศการเรียนรู้แบบมีส่วนร่วม";
  list2: string = "2. สร้างแรงจูงใจจากตัวอย่างเหตุการณ์และสถานการณ์ที่น่าสนใจ";
  list3: string = "3. สร้างแรงจูงใจให้ผู้เรียนได้เรียนรู้จากการลงมือปฏิบัติจริง";
  list4: string = "4. ฝึกให้มีการนำเสนอผลงานและยอมรับแนวคิดจากผู้อื่น";
  list5: string = "5. แบ่งกลุ่มการทำงานหรือฝึกให้ทำงานเป็นทีม";
  list6: string = "6. จัดกิจกรรมการเรียนรู้ที่สอดคล้องกับมาตรฐานและตัวชี้วัดตามหลักสูตรแกนกลาง";
  list7: string = "7. สร้างแรงจูงใจและแรงบันดาลใจแก่ผู้เรียน โดยการกำหนดโจทย์เงื่อนไข สถานการณ์ ที่น่าสนใจและท้าทาย";
  list8: string = "8. ฝึกให้ผู้เรียนได้ปฏิบัติงานจากสถานการณ์จำลองและสถานการณ์จริง";
  list9: string = "9. มีการวัดประเมินผลในรูปแบบที่หลากหลายทั้งก่อนเรียนระหว่างเรียนและหลังเรียน ";
  list10: string = "10. มีการประยุกต์ใช้สื่อ นวัตกรรมและเทคโนโลยีกับการจัดกิจกรรมเพื่อกระตุ้นความความสามารถและสร้างทักษะแก่ผู้เรียน";
  list11: string = "11. ใจกว้างยอมรับในความสามารถ การแสดงออก และความคิดเห็นของที่ผู้เรียน";
  list12: string = "12. วางแผนเกี่ยวกับเวลาในการจัดกิจกรรมการเรียนรู้อย่างชัดเจนทั้งในส่วนของเนื้อหาและกิจกรรม";
  list13: string = "13. ผู้เรียนสร้างองค์ความรู้และจัดระบบการเรียนรู้ด้วยตนเอง";
  list14: string = "14. ผู้เรียนมีส่วนร่วมในกิจกรรมการเรียนการสอน";
  list15: string = "15. ผู้เรียนมีความกระตือรือร้นในการเรียนรู้";
  list16: string = "16. ผู้เรียนมีปฏิสัมพันธ์ที่ดีกับผู้สอนและเพื่อนในชั้นเรียน";
  list17: string = "17. ผู้เรียนกล้านำเสนอและแสดงความคิดเห็นและโต้แย้งอย่างมีเหตุผล";
  list18: string = "18. ผู้เรียนมีความรับผิดชอบสามารถทำกิจกรรมจนสำเร็จลุล่วง";
  list19: string = "19. ผู้เรียนร่วมกันจัดเก็บทำความสะอาดอุปกรณ์และสถานที่หลังการปฏิบัติกิจกรรม";
  list20: string = "เป็นกิจกรรมที่ให้ผู้เรียนมีส่วนร่วมในการเรียนรู้";
  list21: string = "เป็นกิจกรรมการเรียนรู้ที่เน้นให้ผู้เรียนฝึกทักษะการอ่าน การฟัง การพูดและการคิด เช่น การคิดวิเคราะห์ คิดสังเคราะห์ คิดสร้างสรรค์";
  list22: string = "เป็นกิจกรรมที่สร้างสถานการณ์ให้ผู้เรียนได้ลงมือปฏิบัติจริง";
  list23: string = "เป็นกิจกรรมที่เปิดโอกาสให้ผู้เรียนบูรณาการข้อมูล ข่าวสารสารสนเทศและหลักการสู่การสร้างความคิดรวบยอด";
  list24: string = "เป็นกิจกรรมที่มีการสร้างองค์ความรู้ทั้งจากการปฏิบัติ จากประสบการณ์และจากการสรุปทบทวนของผู้เรียน";
  
}
