import { Component } from '@angular/core';

@Component({
  selector: 'app-mnf-spvs-eighth',
  templateUrl: './mnf-spvs-eighth.component.html',
  styleUrls: ['./mnf-spvs-eighth.component.css']
})
export class MnfSpvsEighthComponent {
  loading: boolean = false;

  // ==============================หัวข้อย่อยตอนที่ 1======================================

  list1: string = "1. โครงร่างองค์กรของโรงเรียนที่กำหนดบริบทกำหนดกรอบที่โรงเรียนดำเนินการเป็นอย่างไร";
  list2: string = "2. วิสัยทัศน์ของโรงเรียน";
  list3: string = "3. พันธกิจของโรงเรียนค่านิยมของโรงเรียน";
  list4: string = "4.	โรงเรียนคู่แข่งขันคู่เปรียบเทียบ";
  list5: string = "5.	ค่าเป้าหมายในการพัฒนา";
  list6: string = "6. โรงเรียนมีวิธีการใดในการสร้างกลยุทธ์ในการดำเนินงานของโรงเรียน";
  list7: string = "7. โรงเรียนมีกลยุทธ์ใดที่ใช้ในการดำเนินงานของโรงเรียน";
  list8: string = "8. โรงเรียนมีวิธีการใดในการนำกลยุทธ์ของโรงเรียนไปสู่การปฏิบัติและดำเนินงานของโรงเรียน";
  list9: string = "9. อธิบายกระบวนการที่โรงเรียนใช้ในการรับฟังนักเรียนและผู้มีส่วนได้ ส่วนเสีย ประเมินความพึงพอใจและความไม่พึงพอใจ โดยมีเป้าหมายเพื่อเสาะหาสารสนเทศที่มีคุณค่าเพื่อทำให้เหนือกว่าความคาดหวังของนักเรียนและผู้มีส่วนได้ส่วนเสีย";
  list10: string = "10. อธิบายวิธีการที่โรงเรียนใช้ในการเลือกและใช้ข้อมูลสารสนเทศสำหรับ การวัดผล การดำเนินการ การวิเคราะห์ และการ ทบทวน เพื่อสนับสนุนการวางแผนและการปรับปรุงการดำเนินการของโรงเรียน";
  list11: string = "11. อธิบายการดำเนินการสร้างความตระหนักและชี้แจงแนวทางการพัฒนาโรงเรียนมาตรฐานสากลให้แก่ครู บุคลากร และผู้เกี่ยวข้อง";
  list12: string = "12. อธิบายการดำเนินการทบทวนปรับแผนกลยุทธ์และแผนปฏิบัติการให้สอดคล้องกับแนวทางการพัฒนาโรงเรียนมาตรฐานสากล";
  list13: string = "13. อธิบายการดำเนินการจัดกิจกรรมพัฒนากับโรงเรียนร่วมพัฒนาภาคีเครือข่ายทั้งภายในและต่างประเทศ ";
  list14: string = "14. อธิบายการดำเนินการรายงานผลการประเมินโครงการ พร้อมทั้งประชาสัมพันธ์และเผยแพร่";
  list15: string = "15. อธิบายการดำเนินการศึกษาทำความเข้าใจนโยบายการดำเนินงานของหลักสูตรและการจัดการเรียนการสอน ";
  list16: string = "16. อธิบายการดำเนินการประชุมชี้แจงทำความเข้าใจกับบุคลากรถึงแนวทางการดำเนินงานปรับปรุงและพัฒนาหลักสูตรสถานศึกษา";
  list17: string = "17. อธิบายการดำเนินการกระบวนการเรียนการสอนการวัดผลการประเมินผลตามแนวทางการพัฒนาคุณภาพโรงเรียนมาตรฐานสากล ";
  list18: string = "18. อธิบายการดำเนินการพัฒนาสื่อ นวัตกรรม เทคโนโลยี ห้องสมุดและแหล่งเรียนรู้";
  list19: string = "19. อธิบายการดำเนินการพัฒนาบุคลากรให้สอดคล้องกับคุณภาพและตัวชี้วัดด้านคุณภาพของครู ";
  list20: string = "20. อธิบายการดำเนินการติดต่อประสานงานกับหน่วยงานทางการศึกษาและหน่วยงานอื่น ๆ ในท้องถิ่นทั้งภาครัฐและเอกชนเพื่อสนับสนุนการพัฒนาหลักสูตรและการจัดการเรียนการสอน";
  list21: string = "21. อธิบายการดำเนินการวิจัยพัฒนาหลักสูตรและรูปแบบการสอนรายงานประชาสัมพันธ์และเผยแพร่";
  list22: string = "22. แสดงผลลัพธ์ที่เกิดจากการดำเนินการโครงการโรงเรียนมาตรฐานสากลของโรงเรียน";
  list23: string = "23. ความประสงค์ในการขอรับการประเมินตามเกณฑ์รางวัลคุณภาพในระดับที่สูงขึ้นระบุระยะเวลา";
  
  // =================================================================================

  //==========================หัวข้อย่อย================================================
  sub1: string = "ปัญหาและอุปสรรคในการดำเนินการจัดการเรียนการสอน";
  sub2: string = "แนวทางในการแก้ปัญหา";
  sub3: string = "ปัญหาและอุปสรรคในการดำเนินการบริหารคุณภาพ";
  sub4: string = "แนวทางในการแก้ปัญหา";
  //==================================================================================


}
